Repository: common-repository/ithabich-limit-registration-by-email-domain
Catalog: languages/ithabich-limit-registration-by-email-domain-*.po
Languages: de_de

source: (leave the field blank)
de_de: (Feld leer lassen)

source: Allowed Mail Domains
de_de: Erlaubte Mail-Domains

source: Allowed Mail Domains need to be a comma-seperated list, a single Domain or a complete empty field.
de_de: Erlaubte Mail-Domains müssen eine durch Kommas getrennte Liste, eine einzelne Domain oder ein komplett leeres Feld sein.

source: Blank field
de_de: Leeres Feld

source: Comma-separated list of email domains
de_de: Durch Kommas getrennte Liste von E-Mail-Domains

source: Examples of Incorrect Input:
de_de: Beispiele für falsche Eingabe:

source: However, please keep in mind that it only regulates the registration for WordPress Core. Other plugins, such as 2FA-plugins, BuddyPress, or WooCommerce, may alter the registration process in a way that may affect the settings of this plugin.
de_de: Bitte beachten Sie jedoch, dass es nur die Registrierung für WordPress Core regelt. Andere Plugins, wie z.B. 2FA-Plugins, BuddyPress oder WooCommerce, können den Registrierungsprozess auf eine Weise verändern, die die Einstellungen dieses Plugins beeinflussen kann.

source: In the input field, you can enter either a comma-separated list of domains, a single domain name, or a blank field. The latter resets the setting and no longer filters. Please note that the domains must always begin with an @ symbol.
de_de: Im Eingabefeld können Sie entweder eine durch Kommas getrennte Liste von Domains, einen einzelnen Domainnamen oder ein leeres Feld eingeben. Letzteres setzt die Einstellung zurück und filtert nicht mehr. Bitte beachten Sie, dass die Domains immer mit einem @-Zeichen beginnen müssen.

source: Input Options:
de_de: Eingabeoptionen:

source: Limit registration by mail domain
de_de: Limit der Registrierung nach Mail-Domain

source: Limit registration by mail domain - Settings
de_de: Limit der Registrierung nach Mail-Domain - Einstellungen

source: Limit Registration By Mail Domain to ensure only certain users can register at your WordPress site.
de_de: Begrenzen Sie die Registrierung nach Mail-Domain, um sicherzustellen, dass sich nur bestimmte Benutzer auf Ihrer WordPress-Seite registrieren können.

source: Manage Allowed Email Domains
de_de: Erlaubte E-Mail-Domains verwalten

source: Missing "@" symbol before the domain name
de_de: Fehlendes "@"-Zeichen vor dem Domainnamen

source: Registration limit by mail domain
de_de: Registrierungslimit nach Mail Domain

source: Single domain name
de_de: Einzelner Domainname

source: Space after the "@" symbol
de_de: Leerzeichen nach dem "@"-Zeichen

source: Therefore, it is important to thoroughly check that the restrictions are functioning as desired after any changes.
de_de: Daher ist es wichtig, nach jeder Änderung sicherzustellen, dass die Einschränkungen wie gewünscht funktionieren.

source: With this WordPress plugin, managing the allowed email domains for registration is easy and flexible.
de_de: Mit diesem WordPress-Plugin ist die Verwaltung der erlaubten E-Mail-Domains für die Registrierung einfach und flexibel.

source: You are not allowed to change this setting. Please contact your Administrator.
de_de: Sie sind nicht berechtigt, diese Einstellung zu ändern. Bitte wenden Sie sich an Ihren Administrator.

source: You are not allowed to register.
de_de: Sie sind nicht berechtigt, sich zu registrieren.
